package com.kh.idol.controller;

import java.util.ArrayList;
import java.util.List;

import com.kh.idol.model.vo.Board;
import com.kh.idol.model.vo.Fan;
import com.kh.idol.model.vo.Idol;

public class IdolController {
	private List<Fan> fans = new ArrayList();
	private List<Board> boards = new ArrayList();
	private List<Idol> aespa = new ArrayList(); //1.
	
	// 아이돌들도 어디에 담아놓고 고걸 읽어와서 정보를 출력해줘야 하지않을까?
	{
		
		
		aespa.add(new Idol("카리나", "리더", "Rocket Puncher"));
		aespa.get(0).setImage("""
							⢿⡻⡯⣟⢿⢽⣻⢽⣻⣽⢿⣝⡯⣟⣽⡻⣽⡻⡽⣻⢽⡻⣯
							⡽⡽⣝⢾⢝⡷⣽⣻⣽⣾⢯⣗⢯⣳⡳⣽⡺⣺⢝⣗⢯⢯⢞
							⡽⡽⣺⢽⣝⢾⢽⠳⠱⠫⢟⣼⣳⣷⣽⣺⡺⡽⣝⢮⢯⢯⢯
							⣞⢽⣳⢽⢮⢏⠂⠅⡈⠨⠐⡈⡛⣿⣷⣷⢯⢯⡺⡽⡵⣫⢯
							⡮⣻⣪⢯⢿⠠⡁⡂⢐⠠⠡⢂⢂⠂⢿⡟⡫⣗⢯⢯⣫⢗⡯
							⡯⣳⢽⢽⡿⣍⢬⡨⡐⠨⢘⠪⠡⠡⡘⡎⢌⢾⢝⣵⡳⣫⣞
							⢯⢞⣽⣯⣟⢎⠂⡂⡂⠨⠠⠐⡀⠅⠢⡑⣼⢽⣝⢮⢞⣗⢵
							⢯⢯⣞⣷⣻⡧⡅⡂⠌⢌⠨⡀⡂⢅⢱⢹⢸⢷⢽⢕⡯⣺⢵
							⡽⣕⣯⣿⢽⣏⢳⣄⡑⠱⢑⢐⢐⠐⠅⣷⢽⢽⢽⣕⢯⡳⣝
							⣝⣞⢮⢯⣻⣿⣺⣿⣇⠣⡂⡂⡂⠅⠅⢿⡽⣕⣟⡮⣳⢝⣞
							⣞⢮⡳⣽⣺⣿⣻⣿⡇⡑⡐⡐⠠⠡⠡⢹⣽⣳⣗⣯⢗⡽⣪
							⢾⢝⣞⣞⣾⣻⣿⡻⡐⡐⢐⠠⠡⠨⢨⣾⣻⠘⠾⡽⣽⡺⡵
							⢝⣗⣟⣾⣽⣿⡟⡐⡐⢐⠠⠨⠠⢱⣻⣞⡇⢅⡵⠫⠡⡉⢯
							⣿⡽⣞⣯⣿⡟⡐⡐⢐⠀⡂⠅⢬⡯⣷⢯⣗⢏⠂⠅⢂⠂⡂
							⣿⣻⣿⣿⢿⢐⢀⠂⡐⢀⠂⢬⡯⣯⣯⢿⣺⢐⠨⠨⢐⠀⡂
							⣿⣟⣷⡿⣇⣐⡀⡂⡐⡐⣨⡯⣟⡷⣯⢿⣽⠐⠌⠌⡐⢐⠠
							⣟⣾⣯⣿⡿⣟⣿⣟⣿⡾⣷⢿⣻⣽⢿⣽⢿⠨⡈⠢⢐⢐⠐
							""");
		
		aespa.add(new Idol("지젤", "외국인1", "Xenoglossy"));
		aespa.get(1).setImage(""" 
							⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⢡⢡⡣⣧⢧⡣⡅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⢕⢑
							⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⢨⢎⢮⢺⢽⢕⢕⢝⣜⢌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⢌⠢⡑
							⠡⠡⠡⠡⠡⠡⠡⠡⠡⡁⡇⡇⡇⢇⠇⡇⡇⡧⡳⣕⢅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⠅⢕⠰
							⠡⠡⠡⠡⠡⠡⠡⠡⡑⠄⣗⡵⡕⡕⡕⡜⣜⢎⢯⡺⡸⡨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠨⠢⡑
							⠅⠅⠅⠅⠅⠅⢅⠑⢌⢂⢳⢝⢇⠣⢫⠫⡪⣳⢳⢝⢜⢜⠌⠌⠌⠌⠌⠌⠌⠌⠌⠌⢌⢌⠢
							⠡⠡⠡⠡⠡⡑⢄⢑⢐⢐⢕⡇⡇⡇⡣⡱⡱⡳⣝⢵⢱⢱⠡⠡⠡⠡⠡⠡⠡⠡⠡⠡⡑⡐⡑
							⠅⠅⠅⠅⠕⢌⢂⢂⢂⢂⢇⢧⢙⢎⢎⢮⢪⢫⢮⡳⡕⡕⠅⠅⠅⠅⠅⠅⢅⠅⢕⢑⢐⠌⢌
							⠨⠨⠨⠨⡈⡂⡂⡂⡂⡂⣇⢇⢇⢇⣇⢇⢕⢝⢎⢎⢮⡫⡹⠸⡨⡨⠪⠨⠢⠡⡑⡐⡐⠅⢕
							⠌⠌⠌⢌⢂⢂⢂⠢⡢⣳⣣⢇⢏⢎⢎⢎⢆⠕⡕⣕⢇⢇⢣⢑⢕⠥⡑⡑⡑⡑⢌⢂⠪⠨⠢
							⠡⡑⠅⢕⢐⢐⠅⣕⡽⡵⣝⣮⢪⢪⢪⡪⣎⢆⠌⣞⣮⢪⠢⡢⡱⡱⡨⡨⠨⡊⡢⡡⡑⡑⢕
							⠌⢌⢌⠢⡑⡐⢅⢷⢽⢝⡷⡽⣎⠆⡕⡵⣝⢷⢝⢮⡺⣝⢮⢂⢎⢎⠢⡪⠨⡢⠪⡂⡪⡨⠢
							""");
		aespa.add(new Idol("윈터", "불자", "Armamenter"));
		aespa.get(2).setImage(""" 
							
							⣝⢝⣝⢭⣫⢣⠁⢍⠯⠩⠨⡐⡌⢄⢐⠨⠐⢝⢭⡫⣝⢭⡫⢂⢑⢝
							⢮⢳⢕⣗⢕⡇⠅⡂⠅⡂⢕⢑⠑⡑⢌⠌⡂⡂⡑⣝⢎⢧⢃⠂⡂⡯
							⣝⢮⡳⡵⡝⣎⠂⡂⠅⡂⠅⠀⠂⡀⠂⠅⡂⡂⡂⠸⡭⡣⢑⠐⠠⡫
							⢗⢵⡳⡝⡮⣣⠡⠂⢅⠢⠡⡈⠠⢀⠢⢁⠢⡱⣕⠅⡏⢎⢐⠨⢈⢮
							⢯⡣⣗⣝⢮⡳⠨⡈⠄⢇⠳⢈⠐⢀⠓⠕⢂⠸⣸⠠⡙⠄⡂⠌⠄⢧
							⢵⢝⢮⡪⡧⡳⡁⠆⠅⡂⠐⠠⡈⢄⠀⠂⠄⡑⡌⡆⠌⡐⠠⡁⡊⢮
							⡳⣝⢵⢝⢮⡳⡈⢎⠢⡨⢐⠠⡨⡠⠠⠁⢌⢎⢎⢎⢐⠨⢐⠠⢂⢵
							⣚⢮⡳⣝⢵⢳⠨⡘⢌⠎⡆⡌⠂⢌⠨⠨⢪⢣⠣⡃⡂⠌⡐⠨⢐⠸
							⢄⢑⠨⠠⢑⢈⠢⡈⠢⡑⠌⢜⠸⡐⠅⡃⡑⢄⢑⠐⠄⠅⡂⠅⠢⢈
							⢐⢐⠨⠨⢐⢐⢐⠨⢐⣸⢮⣔⣄⣢⣡⢠⣂⡂⣆⡅⠅⢅⢂⠅⢅⠢
							⣕⢖⡵⣣⢗⣮⣲⢽⣺⣽⣻⣟⣿⣯⡿⣿⣽⡿⣯⡿⣯⣗⠳⠝⡝⠝

							""");
		aespa.add(new Idol("닝닝", "외국인2", "Hacker"));
		aespa.get(3).setImage(""" 

							⡔⡀⠁⠱⡰⡀⡁⢃⠡⣐⣄⣵⣵⣥⣕⣵⣥⡄⡢⡫⡳⢍⢣⠣⡹⡈
							⠕⠅⡂⡁⠑⢕⠢⠐⢼⣿⣳⣿⡳⢯⡿⣾⢽⡿⡜⡜⢜⠜⠜⠌⡊⠄
							⢈⢠⢐⢄⢌⠠⠈⢄⢹⡿⣞⠊⠄⠠⠙⢝⣯⣿⣗⢄⢢⢀⠅⢄⠀⢠
							⠐⠱⠱⠹⡪⠪⡐⠈⡜⣿⡇⠣⠡⠘⡘⠨⣺⣺⡽⠈⠆⡣⠃⠅⠀⢕
							⠰⡱⡸⡜⡜⣜⢆⢕⢼⣟⣯⡂⣑⡐⠠⡡⣻⣞⡎⠌⠢⡂⠕⠀⢰⡱
							⢁⠈⠈⢀⢁⠅⡁⡑⢽⣯⡷⣕⡐⡌⢌⡪⡓⣿⣿⢄⢑⠨⠐⢈⢐⠑
							⡣⠃⠡⡐⡕⡽⡘⠈⠅⢩⡪⡣⣃⢕⡜⡎⠍⡘⡙⡑⢐⠨⠈⠄⢸⠐
							⠁⠠⡣⣳⢱⢱⠀⡁⠨⢰⢕⢽⡸⡪⠊⠐⢐⠠⠠⠐⠠⠁⠌⠀⠕⡕

							""");
		
	}
	
	public List<Idol> findAll() {
		return aespa; // 1. 아이돌의 주소를 가지고있는 배열을 필드로 가진 리스트를 돌려줌.
	}
	
	public Idol findMember(int memberNo) { // 기본적으로는 똑같이 맞춰야 되는게 권장 사항이지만 의미로 안맞아서 바꿈
		
		/*
		if(memberNo == 1) {
			return aespa.get(0);
		} else if(memberNo == 2) {
			return aespa.get(1);
		} else if( memberNo == 3) {
			return aespa.get(2);
		} else {
			return aespa.get(3);
		}
		*/
		return aespa.get(memberNo -1);
	}
	
}